var titles={
  0: {
    subtitle:"Orthopedic Manual Physical Therapy (OMPT)",
    desc: "Η θεραπεία Orthopedic Manual Physical Therapy (OMPT) χρησιμοποιεί πρακτικές τεχνικές όπως κινητοποίηση αρθρώσεων και χειρισμό μαλακών ιστών για την αξιολόγηση και τη θεραπεία μυοσκελετικών παθήσεων, με στόχο την ανακούφιση του πόνου, τη βελτίωση της κινητικότητας και την αποκατάσταση της λειτουργίας του μυοσκελετικού συστήματος. Η OMPT είναι προσαρμοσμένη σε κάθε ασθενή, παρέχοντας εξατομικευμένη φροντίδα για μια σειρά ορθοπεδικών θεμάτων.",
    mainpt:"Η θεραπεία Orthopedic Manual Physical Therapy (OMPT) είναι μια εξειδικευμένη μορφή φυσικοθεραπείας που επικεντρώνεται σε σχολαστικές πρακτικές τεχνικές για την αξιολόγηση και τη θεραπεία μυοσκελετικών παθήσεων. Οι εκπαιδευμένοι επαγγελματίες χρησιμοποιούν διάφορες μεθόδους, όπως κινητοποίηση αρθρώσεων, χειρισμό μαλακών ιστών και θεραπευτικές ασκήσεις για την ανακούφιση του πόνου, τη βελτίωση της κινητικότητας των αρθρώσεων και την αποκατάσταση της βέλτιστης λειτουργίας. Αυτή η προσέγγιση με επίκεντρο τον ασθενή αντιμετωπίζει ένα φάσμα ορθοπεδικών θεμάτων, από πόνο και δυσκαμψία στις αρθρώσεις έως μυϊκές ανισορροπίες και μετεγχειρητική αποκατάσταση. Προσαρμόζοντας τις παρεμβάσεις στις ατομικές ανάγκες κάθε ασθενούς, η OMPT προάγει μια ολοκληρωμένη διαδικασία αποκατάστασης, τονίζοντας τη σημασία της εκπαίδευσης των ασθενών και της ενεργού συμμετοχής. Οι φυσικοθεραπευτές OMPT έχουν υψηλή εξειδίκευση στη διάγνωση και στον προγραμματισμό θεραπείας, διασφαλίζοντας μια εξατομικευμένη και αποτελεσματική πορεία προς την ανάκαμψη για διάφορες ορθοπεδικές περιπτώσεις. Αυτή η ολιστική προσέγγιση, που ενσωματώνει τις χειρωνακτικές θεραπείες και την ενδυνάμωση των ασθενών, τοποθετεί την OMPT ως πολύτιμη μέθοδο για την ενίσχυση της μυοσκελετικής υγείας και την προώθηση της συνολικής ευεξίας."
  },
  1: {
    subtitle:"Βιοϊατρικός Βελονισμός",
    desc:"Ο βελονισμός αποτελεί σημαντικό πυλώνα της υγειονομικής περίθαλψης σε πολλές ασιατικές χώρες, με μια πλούσια και αξιοσέβαστη ιστορία που εκτείνεται σε βάθος άνω των δύο χιλιετιών. Αυτή η θεραπευτική τεχνική περιλαμβάνει τη στρατηγική τοποθέτηση λεπτών βελόνων σε καθορισμένα σημεία βελονισμού. Αυτά τα σημεία, που βρίσκονται είτε στην επιφάνεια είτε βαθύτερα μέσα στο σώμα, συχνά συμπίπτουν με περιοχές ευαίσθητες στην πίεση ή στον πόνο.",
    mainpt:"Ο θεμελιώδης στόχος του βελονισμού είναι η θεραπεία λειτουργικών διαταραχών, συνδρόμων και συμπτωμάτων. Με αυτόν τον τρόπο, στοχεύει στην αποκατάσταση της υγείας του ασθενούς, στη βελτιστοποίηση της λειτουργικής ισορροπίας και στην επίτευξη ομοιόστασης. Η διέγερση συγκεκριμένων σημείων πυροδοτεί ενισχυμένη εγκεφαλική δραστηριότητα και αλλαγές στη ροή του αίματος, επιτρέποντας τελικά την κινητοποίηση ομοιοστατικών μηχανισμών που καταπολεμούν τις ασθένειες ή τη δυσλειτουργία. Οι χαρακτηριστικές δράσεις του βελονισμού είναι αναλγητικές (ανακουφίζουν τον πόνο), αγχολυτικές (μειώνουν το άγχος), αγγειοτασικές (ρυθμίζουν την αρτηριακή πίεση) και νευροτροποποιητικές (εξισορροπούν το νευρικό σύστημα)."
  },
  2: {
    subtitle:"Τεχνική ξηράς βελόνας (Dry needling)",
    desc:"Το Dry Needling περιλαμβάνει την εισαγωγή λεπτών βελόνων σε συγκεκριμένα σημεία ή σφιγμένους μύες, με στόχο την απελευθέρωση της έντασης και την ανακούφιση του πόνου. Χρησιμοποιείται ευρέως στη φυσικοθεραπεία, ενισχύοντας τη μυϊκή λειτουργία και προάγοντας την επούλωση.",
    mainpt:"Το Dry needling διαφέρει σαφώς από το βελονισμό. Αυτή η μέθοδος περιλαμβάνει τη χρήση μιας αποστειρωμένης βελόνας, παρόμοια με τις παραδοσιακές βελόνες βελονισμού, που εισάγονται στην περιοχή του πόνου. Ενισχύει την τοπική κυκλοφορία του αίματος και διακόπτει την αισθήση του πόνου προκαλώντας μια έντονη σύσπαση, που οδηγεί στην καταπολέμηση της δυσφορίας. Ιδιαίτερα αποτελεσματική για το σύνδρομο μυοπεριτοναϊκού πόνου, αυτή η τεχνική είναι ωφέλιμη, ειδικά για τους αθλητές. Η εισαγωγή της βελόνας είναι γενικά ανεπαίσθητη, προκαλώντας περιστασιακά ένα ελαφρύ αίσθημα καύσου. Στο σημείο εφαρμογής, προκαλείται μια μικρή τοπική μυϊκή σύσπαση, η οποία εκλαμβάνεται ως επώδυνη από κάποιους και ανακουφιστική από άλλους. Χορηγούμενη από εξειδικευμένο φυσικοθεραπευτή μετά από μια ολοκληρωμένη αξιολόγηση του ιατρικού ιστορικού για τον εντοπισμό πιθανών αντενδείξεων, η τεχνική θεωρείται εξαιρετικά ασφαλής."

  },
  3: {
    subtitle:"Θεραπεία TECAR (Transfer Energy Capacitive & Resistive )",
    desc: "Η τεχνολογία TECAR (Διαβίβαση Ενέργειας μέσω Χωρητικότητας και Αντίστασης) αναφέρεται σε μια μορφή φυσικοθεραπείας που χρησιμοποιείται για τη θεραπεία πόνου, φλεγμονής, τραυματισμών και παθήσεων του μυοσκελετικού συστήματος.",
    mainpt:"Η θεραπεία TECAR (Διαβίβαση Ενέργειας μέσω Χωρητικότητας και Αντίστασης) είναι μια εξειδικευμένη φυσικοθεραπευτική τεχνική που χρησιμοποιεί ενέργεια ραδιοσυχνοτήτων για θεραπευτικούς σκοπούς. Η τεχνολογία αυτή περιλαμβάνει την εφαρμογή ηλεκτροδίων χωρητικότητας και αντίστασης για τη δημιουργία θερμότητας στους ιστούς. Η χωρητική λειτουργία στοχεύει σε επιφανειακούς ιστούς, ενώ η λειτουργία αντίστασης διεισδύει βαθύτερα στους μύες και στις αρθρώσεις. Η θεραπεία TECAR αποσκοπεί στην τόνωση της κυκλοφορίας του αίματος, στη βελτίωση της επούλωσης των ιστών και στην ανακούφιση από τον πόνο. Η μεταφορά ενέργειας προάγει ένα θερμαντικό αποτέλεσμα, αυξάνοντας τον μεταβολισμό των ιστών και την ευλυγισία. Αυτή η προσέγγιση χρησιμοποιείται συχνά στη μυοσκελετική αποκατάσταση, σε τραυματισμούς αθλητών και σε ορθοπεδικές παθήσεις. Η θεραπεία TECAR φημίζεται για την ικανότητά της να επιταχύνει τη φυσική διαδικασία επούλωσης, να μειώνει τη φλεγμονή και να βελτιώνει τη συνολική λειτουργία των ιστών. Όπως συμβαίνει με κάθε θεραπευτική παρέμβαση, η εφαρμογή της πρέπει να γίνεται υπό την καθοδήγηση εκπαιδευμένων επαγγελματιών υγείας που λαμβάνουν υπόψη τις συγκεκριμένες ανάγκες και παθήσεις των ασθενών."
  },
  4: {
    subtitle:"Κρουστικός υπέρηχος",
    desc:"Η θεραπεία κρουστικών κυμάτων είναι μια θεραπευτική τεχνική που χρησιμοποιείται στη φυσικοθεραπεία για την αντιμετώπιση πόνου και διαταραχών του μυοσκελετικού συστήματος. Χρησιμοποιείται ένα μηχάνημα που παράγει υψηλής ενέργειας δονήσεις και τις μεταφέρει στην περιοχή του πόνου.",
    mainpt:"Τα κρουστικά κύματα είναι ακουστικά κύματα υψηλής πιέσεως τα οποία εφαρμόζονται με σημαντικά ποσοστά επιτυχίας στη θεραπεία συγκεκριμένων μυοσκελετικών παθήσεων, τα τελευταία, περίπου, 20 χρόνια. Επιφέρουν βελτίωση της αιματικής ροής τοπικά, προκαλούν αγγειογένεση, διεγείρουν την παραγωγή κολλαγόνου, διαλύουν επασβεστώσεις και προάγουν την αναδόμηση των ιστών. Η θεραπεία κρουστικών κυμάτων είναι μία μη χειρουργική θεραπεία, τα αποτελέσματα της οποίας προσεγγίζουν αυτά του χειρουργείου. Ιδιαίτερες παρενέργειες δεν παρατηρούνται. Προηγείται αξιολόγηση του ασθενούς κατά την οποία καθορίζεται αν και εφόσον μπορεί να εφαρμοστεί η θεραπεία κρουστικών κυμάτων. Η χρήση τους γίνεται κατόπιν σύστασης του θεράποντος ιατρού σε περιπτώσεις όπου τα συμπτώματα επιμένουν για διάστημα άνω των 3 μηνών, ενώ ταυτόχρονα τα υπόλοιπα είδη θεραπείας δεν έχουν επιφέρει σαφή βελτίωση στην κλινική εικόνα του ασθενούς. Συνήθεις παθήσεις που αποτελούν ένδειξη χρήσης κρουστικών κυμάτων είναι οι πελματιαία απονευρωσίτιδα, τενοντίτιδα αχιλλείου τένοντα, τενοντίτιδα στροφικού πετάλου του ώμου, ασβεστοποιός τενοντίτιδα υπερακανθίου, επικονδυλίτιδα αγκώνα (tennis elbow), επιτροχιλίτιδα αγκώνα (golfer’s elbow), οργονοθυλακίτιδα- τροχαντηρίτιδα ισχίου, εκτινασσόμενος δάκτυλος (trigger finger), επώδυνος μυϊκός σπασμός, μυοπεριτοναϊκός πόνος και σύνδρομο de Quervain."
  },
  5: {
    subtitle:"Σταθερό Taping (Κinesiotaping)",
    desc:"Η τεχνική της «Κινησιοεπίδεσης» περιλαμβάνει την εφαρμογή ελαστικών κολλητικών ταινιών για τη στήριξη των μυών και των αρθρώσεων. Αυτή η τεχνική ενισχύει την κυκλοφορία του αίματος, μειώνει τη φλεγμονή και προσφέρει δομική υποστήριξη χωρίς να περιορίζει την κίνηση. Χρησιμοποιείται ευρέως στην αθλητική ιατρική, στοχεύει στην ενίσχυση της απόδοσης, στη διαχείριση του πόνου και βοηθάει σημαντικά στην επιτάχυνση των φυσικών διεργασιών επούλωσης τραυματισμών του σώματος.",
    mainpt:"Το Kinesiotaping είναι μια θεραπευτική τεχνική που κερδίζει δημοτικότητα στη φυσιοθεραπεία και την αθλητική ιατρική λόγω των ποικίλων εφαρμογών και των πλεονεκτημάτων της. Αυτή η μέθοδος περιλαμβάνει την εφαρμογή ελαστικών κολλητικών ταινιών σε στοχευμένες περιοχές, προσφέροντας δομική στήριξη χωρίς περιορισμό της κίνησης. Η ελαστικότητα της ταινίας μιμείται την ευκαμψία του δέρματος, βελτιώνοντας τη ροή του αίματος, της λέμφου και των ενδοκυτταρικών υγρών. Το Kinesiotaping είναι γνωστό για την ικανότητά του να ανακουφίζει τον πόνο, να μειώνει τη φλεγμονή και να παρέχει υποστήριξη στους μύες και τις αρθρώσεις. Χρησιμοποιείται ευρέως στη διαχείριση διαφόρων μυοσκελετικών καταστάσεων, βοηθώντας στην αποκατάσταση τραυματισμών και ενισχύοντας την αθλητική απόδοση. Επιπλέον, η εφαρμογή της ταινίας μπορεί να βελτιώσει τη θέση και την κίνηση του σώματος. Το υλικό της ταινίας επιτρέπει την παρατεταμένη χρήση, συμβάλλοντας τόσο στην αντιμετώπιση παροδικών- οξέων όσο και χρόνιων τραυματισμών. Πολλοί επαγγελματίες και ασθενείς αναγνωρίζουν τα οφέλη της θεραπείας όσον αφορά τη διευκόλυνση των φυσικών διαδικασιών επούλωσης τραυματισμών του σώματος."
  },
  6: {
    subtitle:"Αναπνευστική Φυσικοθεραπεία",
    desc:"Η αναπνευστική φυσικοθεραπεία εστιάζει στη βελτιστοποίηση της πνευμονικής λειτουργίας μέσω προσαρμοσμένων παρεμβάσεων. Οι θεραπευτές χρησιμοποιούν ασκήσεις αναπνοής, φυσιοθεραπεία στο στήθος και εξατομικευμένα σχέδια για την ενίσχυση των αναπνευστικών μυών, τη βελτίωση του αερισμού και την ενδυνάμωση των ασθενών να διαχειριστούν τα συμπτώματα αποτελεσματικά, προωθώντας μια πιο υγιή και πιο δραστήρια ζωή.",
    mainpt:"Η αναπνευστική φυσικοθεραπεία παίζει καθοριστικό ρόλο στη βελτίωση της αναπνευστικής λειτουργίας και της συνολικής υγείας των πνευμόνων, ειδικά σε περιπτώσεις που αφορούν παθήσεις του αναπνευστικού. Αυτή η εξειδικευμένη μορφή θεραπείας χρησιμοποιεί διάφορες παρεμβάσεις, όπως ασκήσεις αναπνοής, φυσιοθεραπεία στο στήθος και εξατομικευμένα σχέδια θεραπείας προσαρμοσμένα στις συγκεκριμένες ανάγκες των ατόμων με αναπνευστικές δυσκολίες. Εφαρμόζεται συνήθως στη διαχείριση χρόνιων αναπνευστικών παθήσεων όπως η χρόνια αποφρακτική πνευμονοπάθεια (ΧΑΠ), το άσθμα και η μετεγχειρητική ανάρρωση. Η αναπνευστική φυσικοθεραπεία στοχεύει στην ενίσχυση της ικανότητας των πνευμόνων, στην ενίσχυση των αναπνευστικών μυών και στη βελτίωση της αποτελεσματικότητας του αερισμού. Οι ασθενείς, ιδιαίτερα εκείνοι με μειωμένη πνευμονική λειτουργία, επωφελούνται από τις στοχευμένες ασκήσεις και τις θεραπευτικές τεχνικές, οι οποίες συμβάλλουν στην αυξημένη ανοχή στην άσκηση και στη βελτίωση της ποιότητας ζωής. Αυτή η μορφή θεραπείας είναι αναπόσπαστο μέρος για την αντιμετώπιση αναπνευστικών προβλημάτων, την προώθηση της βέλτιστης πνευμονικής λειτουργίας και την ενδυνάμωση των ατόμων να διαχειριστούν και να αντιμετωπίσουν αποτελεσματικά τις αναπνευστικές τους καταστάσεις."
  },
  //7: {
  //  subtitle:"Myofascial Pain Syndrome (MPS)",
  //  desc:"Myofascial Pain Syndrome (MPS) is a chronic condition characterized by trigger points in taut muscle fibers, causing regional pain. Often resulting from overuse or trauma, MPS leads to muscle stiffness and discomfort. Treatment involves manual therapies and exercises to alleviate pain and enhance muscle function.",
  //  mainpt:"Myofascial Pain Syndrome (MPS) is present in up to 85% of cases involving chronic musculoskeletal pain, with pain potentially occurring anywhere in the body. Traditionally, musculoskeletal pain was attributed to joint and nerve degeneration. However, recent findings emphasize that muscular issues, often stemming from excessive strain in work, sports, or daily activities, can contribute significantly. Muscle pain might manifest as a primary concern or coexist with conditions like osteoarthritis. Notably, muscle pain can manifest in areas distant from its origin, like neck muscles causing headaches or abdominal muscles contributing to lower back pain. American researchers have identified that improper use of the muscular system can strain neuromuscular structures, leading to painful muscle contractions known as Myoperitoneal Pain Syndrome. These contractions create trigger points, disrupting blood circulation, entrapping nerve fibers, and causing persistent and intense pain. Treating these points aims to locally release contracted muscle fibers, enhancing blood flow and fostering anti-inflammatory processes. Trigger points, detectable through palpation, can be effectively treated even after prolonged stimulation."
  //},
};


var thumbsSwiper=new Swiper(".thumbsSwiper",{
  spaceBetween:10,
  slidesPerView:5,
  breakpoints:{
    200:{
      slidesPerView:1.5
    },
    400:{
      slidesPerView:1.5
    },
    600:{
      slidesPerView:3
    },
    1100:{
      slidesPerView:5
    },
  },
  freeMode: true,
  watchSlidesProgress:true,
})


const swiper = new Swiper('.bannerSwiper', {
  // Optional parameters
  spaceBetween:0,
  effect:"fade",

  // If we need pagination
  pagination: {
    el: '.swiper-pagination',
    clickable:true,
  },

  // Navigation arrows
  navigation: {
    nextEl: '.swiper-button-next',
    prevEl: '.swiper-button-prev',
  },
//Make thumbs slider works as thumbs for the banner Slider
  thumbs:{
    swiper:thumbsSwiper
  }
});

//Change titles

var changeTitle=(index)=>{
  var subtitle=document.querySelector('#sub-title');
  var desc=document.querySelector('#desc');
  var mainpt=document.querySelector('.services_modal_content_therapies p');
  var mainpt_sub=document.querySelector('.services_modal_title');
  subtitle.innerHTML = `<p>${titles[index].subtitle}</p>`;
  desc.innerHTML = `<p>${titles[index].desc}</p>`;
  mainpt.innerHTML = `<p>${titles[index].mainpt}</p>`;
  mainpt_sub.innerHTML=`<h4>${titles[index].subtitle}</h4>`;
  $(document).ready(function() {
  // Get the element by its ID
  var myElement = $(".btn_primary");

  // Add the class "highlight"
  myElement.addClass("highlight");

  // Set a timeout to remove the class after 10 seconds
  setTimeout(function() {
    // Remove the class "highlight"
    myElement.removeClass("highlight");
  }, 5000);
});
}

//activeIndexChange is a swiper event
swiper.on('activeIndexChange',function(){
  changeTitle(swiper.activeIndex);
})
